            IDENTIFICATION          DIVISION.
            PROGRAM-ID. COBOLBASICS0001.
            AUTHOR.     AUGUSTO GUERRA DE LIMA.
            PROCEDURE               DIVISION.
                DISPLAY 'HELLO WORLD !'.
                STOP RUN.
