//JES2JOB1  JOB
//COMBINE   EXEC PGM=IRXJCL,PARM='COMBINE'
//SYSEXEC   DD DSN=ZXP.PUBLIC.EXEC,DISP=SHR
//SYSTSPRT  DD DSN=&SYSUID..OUTPUT(GUITARF),DISP=SHR
//SYSTSIN   DD DUMMY
//NICKNAME  DD DSN=ZXP.PUBLIC.SOURCE(NICKNAME),DISP=SHR
//BRAND     DD DSN=ZXP.PUBLIC.SOURCE(BRAND),DISP=SHR
//ARTIST    DD DSN=ZXP.PUBLIC.SOURCE(ARTIST),DISP=SHR